## WEB SCRAPING

In this project  I am going to do  web scraping  using  BeautifulSoup, requests libraries and Python code to extract data from the Fake Python jobs website then I will perform some data cleaning on the dataframe  to prepare the data for analysis.

## Importing libraries

In [94]:
from bs4 import BeautifulSoup
import requests 
import pandas as pd

In [95]:
url = "https://realpython.github.io/fake-jobs/"

In [96]:
source = requests.get(url)
soup = BeautifulSoup(source.content, 'html.parser')  # extracting the html document

jobs = soup.find_all('div', class_='column is-half')  # extracting data

# Initializing empty lists to store job details
jobtitles = []
companies = []
locations = []
dates = []

# Using a loop to get the details of each feature
for job in jobs:
    jobtitle = job.find('h2', class_='title is-5').get_text()
    company = job.find('h3', class_='subtitle is-6 company').get_text()
    location = job.find('p', class_='location').get_text()
    date = job.find('time', datetime="2021-04-08").get_text()
    
    # Appending each detail to the corresponding list
    jobtitles.append(jobtitle)
    companies.append(company)
    locations.append(location)
    dates.append(date)

# Creating a DataFrame after collecting all job details
df = pd.DataFrame({
    "Job Title": jobtitles,
    "Company": companies,
    "Location": locations,
    "Date": dates
})

df.head()

,Job Title,Company,Location,Date
0,Senior Python Developer,"Payne, Roberts and Davis","\n Stewartbury, AA\n",2021-04-08
1,Energy engineer,Vasquez-Davidson,"\n Christopherville, AA\n",2021-04-08
2,Legal executive,"Jackson, Chambers and Levy","\n Port Ericaburgh, AA\n",2021-04-08
3,Fitness centre manager,Savage-Bradley,"\n East Seanview, AP\n",2021-04-08
4,Product manager,Ramirez Inc,"\n North Jamieview, AP\n",2021-04-08

# Data cleaning

Now that I have my data in  a data frame I am going to do some data cleaning so that the data can be ready for exploratory data analysis

In [125]:
df.shape

(100, 4)

In [117]:
#removing speacial characters and other unnecessary letters from the Location column
df['Location'] = df['Location'].str.replace('\n', "").str.split(',', expand = True)[0]
df['Location'].head()

0                 Stewartbury
1            Christopherville
2             Port Ericaburgh
3               East Seanview
4             North Jamieview
Name: Location, dtype: object

In [119]:
df.head()

,Job Title,Company,Location,Date
0,Senior Python Developer,"Payne, Roberts and Davis",Stewartbury,2021-04-08
1,Energy engineer,Vasquez-Davidson,Christopherville,2021-04-08
2,Legal executive,"Jackson, Chambers and Levy",Port Ericaburgh,2021-04-08
3,Fitness centre manager,Savage-Bradley,East Seanview,2021-04-08
4,Product manager,Ramirez Inc,North Jamieview,2021-04-08

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Job Title  100 non-null    object
 1   Company    100 non-null    object
 2   Location   100 non-null    object
 3   Date       100 non-null    object
dtypes: object(4)
memory usage: 3.3+ KB

The dataset has no null values

In [123]:
#changing the datatype for the Date column
import datetime
df['Date'] = pd.to_datetime(df['Date'])
df['Date'].head(2)

0   2021-04-08
1   2021-04-08
Name: Date, dtype: datetime64[ns]

In [130]:
df.tail()

,Job Title,Company,Location,Date
95,Museum/gallery exhibitions officer,"Nguyen, Yoder and Petty",Lake Abigail,2021-04-08
96,"Radiographer, diagnostic",Holder LLC,Jacobshire,2021-04-08
97,Database administrator,Yates-Ferguson,Port Susan,2021-04-08
98,Furniture designer,Ortega-Lawrence,North Tiffany,2021-04-08
99,Ship broker,"Fuentes, Walls and Castro",Michelleville,2021-04-08

The dataset is now clean. Thank you.